// 11.	Дано число больше 9. Вывести на экран  вторую цифру числа с конца.

int a = 1247;
if (a>=10) System.Console.WriteLine(a/10%10);


