// 8.	Вывести на экран числа от -N до N

int i=-8;
int N=8;
while(i<=N)
{
    System.Console.Write($"{i} ");
    i=i+1;
}