// 25.	Вывести на экран кубы чисел от 1 до N.

int i=1;
int N=10;
int r=2;
while(i<=N)
{
    System.Console.WriteLine($"{i}^3 = {i*i*i}");
    i=i+1;    
}
